HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEvadc_reg.h
/** \brief 1C88, Analog Fct. Config. Register, Group 6 */
#define EVADC_G6_ANCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0021C88u)
/** Alias (User Manual Name) for EVADC_G6_ANCFG.
* To use register names with standard convension, please use EVADC_G6_ANCFG.
*/
#define EVADC_G6ANCFG (EVADC_G6_ANCFG)

/** \brief 1CA0, Input Class Register 0, Group 6 */
#define EVADC_G6_ICLASS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0021CA0u)
/** Alias (User Manual Name) for EVADC_G6_ICLASS0.
* To use register names with standard convension, please use EVADC_G6_ICLASS0.
*/
#define EVADC_G6ICLASS0 (EVADC_G6_ICLASS0)

/** \brief 1CA4, Input Class Register 1, Group 6 */
#define EVADC_G6_ICLASS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0021CA4u)
/** Alias (User Manual Name) for EVADC_G6_ICLASS1.
* To use register names with standard convension, please use EVADC_G6_ICLASS1.
*/
#define EVADC_G6ICLASS1 (EVADC_G6_ICLASS1)

/** \brief 1CB0, Alias Register, Group 6 */
#define EVADC_G6_ALIAS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF0021CB0u)
/** Alias (User Manual Name) for EVADC_G6_ALIAS.
* To use register names with standard convension, please use EVADC_G6_ALIAS.
*/
#define EVADC_G6ALIAS (EVADC_G6_ALIAS)

/** \brief 1CB8, Boundary Select Register, Group 6 */
#define EVADC_G6_BOUND /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF0021CB8u)
/** Alias (User Manual Name) for EVADC_G6_BOUND.
* To use register names with standard convension, please use EVADC_G6_BOUND.
*/
#define EVADC_G6BOUND (EVADC_G6_BOUND)

/** \brief 1CC0, Synchronization Control Register, Group 6 */
#define EVADC_G6_SYNCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF0021CC0u)
/** Alias (User Manual Name) for EVADC_G6_SYNCTR.
* To use register names with standard convension, please use EVADC_G6_SYNCTR.
*/
#define EVADC_G6SYNCTR (EVADC_G6_SYNCTR)

/** \brief 1D00, Queue 0 Source Contr. Register, Group 6 */
#define EVADC_G6_Q0_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021D00u)
/** Alias (User Manual Name) for EVADC_G6_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G6_Q0_QCTRL.
*/
#define EVADC_G6QCTRL0 (EVADC_G6_Q0_QCTRL)

/** \brief 1D04, Queue 0 Mode Register, Group 6 */
#define EVADC_G6_Q0_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021D04u)
/** Alias (User Manual Name) for EVADC_G6_Q0_QMR.
* To use register names with standard convension, please use EVADC_G6_Q0_QMR.
*/
#define EVADC_G6QMR0 (EVADC_G6_Q0_QMR)

/** \brief 1D08, Queue 0 Status Register, Group 6 */
#define EVADC_G6_Q0_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021D08u)
/** Alias (User Manual Name) for EVADC_G6_Q0_QSR.
* To use register names with standard convension, please use EVADC_G6_Q0_QSR.
*/
#define EVADC_G6QSR0 (EVADC_G6_Q0_QSR)

/** \brief 1D0C, Queue 0 Register 0, Group 6 */
#define EVADC_G6_Q0_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0021D0Cu)
/** Alias (User Manual Name) for EVADC_G6_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G6_Q0_Q0R.
*/
#define EVADC_G6Q0R0 (EVADC_G6_Q0_Q0R)

/** \brief 1D10, Queue 0 Input Register, Group 6 */
#define EVADC_G6_Q0_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021D10u)
/** Alias (User Manual Name) for EVADC_G6_Q0_QINR.
* To use register names with standard convension, please use EVADC_G6_Q0_QINR.
*/
#define EVADC_G6QINR0 (EVADC_G6_Q0_QINR)

/** \brief 1D14, Queue 0 Backup Register, Group 6 */
#define EVADC_G6_Q0_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021D14u)
/** Alias (User Manual Name) for EVADC_G6_Q0_QBUR.
* To use register names with standard convension, please use EVADC_G6_Q0_QBUR.
*/
#define EVADC_G6QBUR0 (EVADC_G6_Q0_QBUR)

/** \brief 1D18, Queue 0 Requ. Timer Mode Reg., Group 6 */
#define EVADC_G6_Q0_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021D18u)
/** Alias (User Manual Name) for EVADC_G6_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G6_Q0_REQTM.
*/
#define EVADC_G6REQTM0 (EVADC_G6_Q0_REQTM)

/** \brief 1D1C, Queue 0 Requ. Timer Status Reg., Group 6 */
#define EVADC_G6_Q0_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0021D1Cu)
/** Alias (User Manual Name) for EVADC_G6_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G6_Q0_REQTS.
*/
#define EVADC_G6REQTS0 (EVADC_G6_Q0_REQTS)

/** \brief 1D20, Queue 1 Source Contr. Register, Group 6 */
#define EVADC_G6_Q1_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021D20u)
/** Alias (User Manual Name) for EVADC_G6_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G6_Q1_QCTRL.
*/
#define EVADC_G6QCTRL1 (EVADC_G6_Q1_QCTRL)

/** \brief 1D24, Queue 1 Mode Register, Group 6 */
#define EVADC_G6_Q1_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021D24u)
/** Alias (User Manual Name) for EVADC_G6_Q1_QMR.
* To use register names with standard convension, please use EVADC_G6_Q1_QMR.
*/
#define EVADC_G6QMR1 (EVADC_G6_Q1_QMR)

/** \brief 1D28, Queue 1 Status Register, Group 6 */
#define EVADC_G6_Q1_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021D28u)
/** Alias (User Manual Name) for EVADC_G6_Q1_QSR.
* To use register names with standard convension, please use EVADC_G6_Q1_QSR.
*/
#define EVADC_G6QSR1 (EVADC_G6_Q1_QSR)

/** \brief 1D2C, Queue 1 Register 0, Group 6 */
#define EVADC_G6_Q1_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0021D2Cu)
/** Alias (User Manual Name) for EVADC_G6_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G6_Q1_Q0R.
*/
#define EVADC_G6Q0R1 (EVADC_G6_Q1_Q0R)

/** \brief 1D30, Queue 1 Input Register, Group 6 */
#define EVADC_G6_Q1_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021D30u)
/** Alias (User Manual Name) for EVADC_G6_Q1_QINR.
* To use register names with standard convension, please use EVADC_G6_Q1_QINR.
*/
#define EVADC_G6QINR1 (EVADC_G6_Q1_QINR)

/** \brief 1D34, Queue 1 Backup Register, Group 6 */
#define EVADC_G6_Q1_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021D34u)
/** Alias (User Manual Name) for EVADC_G6_Q1_QBUR.
* To use register names with standard convension, please use EVADC_G6_Q1_QBUR.
*/
#define EVADC_G6QBUR1 (EVADC_G6_Q1_QBUR)

