HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEvadc_reg.h
/** \brief 1EA8, Group 6 Result Control Register 10 */
#define EVADC_G6_RCR10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021EA8u)
/** Alias (User Manual Name) for EVADC_G6_RCR10.
* To use register names with standard convension, please use EVADC_G6_RCR10.
*/
#define EVADC_G6RCR10 (EVADC_G6_RCR10)

/** \brief 1EAC, Group 6 Result Control Register 11 */
#define EVADC_G6_RCR11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021EACu)
/** Alias (User Manual Name) for EVADC_G6_RCR11.
* To use register names with standard convension, please use EVADC_G6_RCR11.
*/
#define EVADC_G6RCR11 (EVADC_G6_RCR11)

/** \brief 1EB0, Group 6 Result Control Register 12 */
#define EVADC_G6_RCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021EB0u)
/** Alias (User Manual Name) for EVADC_G6_RCR12.
* To use register names with standard convension, please use EVADC_G6_RCR12.
*/
#define EVADC_G6RCR12 (EVADC_G6_RCR12)

/** \brief 1EB4, Group 6 Result Control Register 13 */
#define EVADC_G6_RCR13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021EB4u)
/** Alias (User Manual Name) for EVADC_G6_RCR13.
* To use register names with standard convension, please use EVADC_G6_RCR13.
*/
#define EVADC_G6RCR13 (EVADC_G6_RCR13)

/** \brief 1EB8, Group 6 Result Control Register 14 */
#define EVADC_G6_RCR14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021EB8u)
/** Alias (User Manual Name) for EVADC_G6_RCR14.
* To use register names with standard convension, please use EVADC_G6_RCR14.
*/
#define EVADC_G6RCR14 (EVADC_G6_RCR14)

/** \brief 1EBC, Group 6 Result Control Register 15 */
#define EVADC_G6_RCR15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021EBCu)
/** Alias (User Manual Name) for EVADC_G6_RCR15.
* To use register names with standard convension, please use EVADC_G6_RCR15.
*/
#define EVADC_G6RCR15 (EVADC_G6_RCR15)

/** \brief 1F00, Group 6 Result Register 0\n */
#define EVADC_G6_RES0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F00u)
/** Alias (User Manual Name) for EVADC_G6_RES0.
* To use register names with standard convension, please use EVADC_G6_RES0.
*/
#define EVADC_G6RES0 (EVADC_G6_RES0)

/** \brief 1F04, Group 6 Result Register 1\n */
#define EVADC_G6_RES1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F04u)
/** Alias (User Manual Name) for EVADC_G6_RES1.
* To use register names with standard convension, please use EVADC_G6_RES1.
*/
#define EVADC_G6RES1 (EVADC_G6_RES1)

/** \brief 1F08, Group 6 Result Register 2\n */
#define EVADC_G6_RES2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F08u)
/** Alias (User Manual Name) for EVADC_G6_RES2.
* To use register names with standard convension, please use EVADC_G6_RES2.
*/
#define EVADC_G6RES2 (EVADC_G6_RES2)

/** \brief 1F0C, Group 6 Result Register 3\n */
#define EVADC_G6_RES3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F0Cu)
/** Alias (User Manual Name) for EVADC_G6_RES3.
* To use register names with standard convension, please use EVADC_G6_RES3.
*/
#define EVADC_G6RES3 (EVADC_G6_RES3)

/** \brief 1F10, Group 6 Result Register 4\n */
#define EVADC_G6_RES4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F10u)
/** Alias (User Manual Name) for EVADC_G6_RES4.
* To use register names with standard convension, please use EVADC_G6_RES4.
*/
#define EVADC_G6RES4 (EVADC_G6_RES4)

/** \brief 1F14, Group 6 Result Register 5\n */
#define EVADC_G6_RES5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F14u)
/** Alias (User Manual Name) for EVADC_G6_RES5.
* To use register names with standard convension, please use EVADC_G6_RES5.
*/
#define EVADC_G6RES5 (EVADC_G6_RES5)

/** \brief 1F18, Group 6 Result Register 6\n */
#define EVADC_G6_RES6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F18u)
/** Alias (User Manual Name) for EVADC_G6_RES6.
* To use register names with standard convension, please use EVADC_G6_RES6.
*/
#define EVADC_G6RES6 (EVADC_G6_RES6)

/** \brief 1F1C, Group 6 Result Register 7\n */
#define EVADC_G6_RES7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F1Cu)
/** Alias (User Manual Name) for EVADC_G6_RES7.
* To use register names with standard convension, please use EVADC_G6_RES7.
*/
#define EVADC_G6RES7 (EVADC_G6_RES7)

/** \brief 1F20, Group 6 Result Register 8\n */
#define EVADC_G6_RES8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F20u)
/** Alias (User Manual Name) for EVADC_G6_RES8.
* To use register names with standard convension, please use EVADC_G6_RES8.
*/
#define EVADC_G6RES8 (EVADC_G6_RES8)

/** \brief 1F24, Group 6 Result Register 9\n */
#define EVADC_G6_RES9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F24u)
/** Alias (User Manual Name) for EVADC_G6_RES9.
* To use register names with standard convension, please use EVADC_G6_RES9.
*/
#define EVADC_G6RES9 (EVADC_G6_RES9)

/** \brief 1F28, Group 6 Result Register 10\n */
#define EVADC_G6_RES10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F28u)
/** Alias (User Manual Name) for EVADC_G6_RES10.
* To use register names with standard convension, please use EVADC_G6_RES10.
*/
#define EVADC_G6RES10 (EVADC_G6_RES10)

/** \brief 1F2C, Group 6 Result Register 11\n */
#define EVADC_G6_RES11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F2Cu)
/** Alias (User Manual Name) for EVADC_G6_RES11.
* To use register names with standard convension, please use EVADC_G6_RES11.
*/
#define EVADC_G6RES11 (EVADC_G6_RES11)

/** \brief 1F30, Group 6 Result Register 12\n */
#define EVADC_G6_RES12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F30u)
/** Alias (User Manual Name) for EVADC_G6_RES12.
* To use register names with standard convension, please use EVADC_G6_RES12.
*/
#define EVADC_G6RES12 (EVADC_G6_RES12)

/** \brief 1F34, Group 6 Result Register 13\n */
#define EVADC_G6_RES13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F34u)
/** Alias (User Manual Name) for EVADC_G6_RES13.
* To use register names with standard convension, please use EVADC_G6_RES13.
*/
#define EVADC_G6RES13 (EVADC_G6_RES13)

/** \brief 1F38, Group 6 Result Register 14\n */
#define EVADC_G6_RES14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F38u)
/** Alias (User Manual Name) for EVADC_G6_RES14.
* To use register names with standard convension, please use EVADC_G6_RES14.
*/
#define EVADC_G6RES14 (EVADC_G6_RES14)

