HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEvadc_reg.h
/** \brief 1F3C, Group 6 Result Register 15\n */
#define EVADC_G6_RES15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021F3Cu)
/** Alias (User Manual Name) for EVADC_G6_RES15.
* To use register names with standard convension, please use EVADC_G6_RES15.
*/
#define EVADC_G6RES15 (EVADC_G6_RES15)

/** \brief 1F80, Group 6 Result Reg. 0, Debug */
#define EVADC_G6_RESD0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021F80u)
/** Alias (User Manual Name) for EVADC_G6_RESD0.
* To use register names with standard convension, please use EVADC_G6_RESD0.
*/
#define EVADC_G6RESD0 (EVADC_G6_RESD0)

/** \brief 1F84, Group 6 Result Reg. 1, Debug */
#define EVADC_G6_RESD1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021F84u)
/** Alias (User Manual Name) for EVADC_G6_RESD1.
* To use register names with standard convension, please use EVADC_G6_RESD1.
*/
#define EVADC_G6RESD1 (EVADC_G6_RESD1)

/** \brief 1F88, Group 6 Result Reg. 2, Debug */
#define EVADC_G6_RESD2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021F88u)
/** Alias (User Manual Name) for EVADC_G6_RESD2.
* To use register names with standard convension, please use EVADC_G6_RESD2.
*/
#define EVADC_G6RESD2 (EVADC_G6_RESD2)

/** \brief 1F8C, Group 6 Result Reg. 3, Debug */
#define EVADC_G6_RESD3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021F8Cu)
/** Alias (User Manual Name) for EVADC_G6_RESD3.
* To use register names with standard convension, please use EVADC_G6_RESD3.
*/
#define EVADC_G6RESD3 (EVADC_G6_RESD3)

/** \brief 1F90, Group 6 Result Reg. 4, Debug */
#define EVADC_G6_RESD4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021F90u)
/** Alias (User Manual Name) for EVADC_G6_RESD4.
* To use register names with standard convension, please use EVADC_G6_RESD4.
*/
#define EVADC_G6RESD4 (EVADC_G6_RESD4)

/** \brief 1F94, Group 6 Result Reg. 5, Debug */
#define EVADC_G6_RESD5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021F94u)
/** Alias (User Manual Name) for EVADC_G6_RESD5.
* To use register names with standard convension, please use EVADC_G6_RESD5.
*/
#define EVADC_G6RESD5 (EVADC_G6_RESD5)

/** \brief 1F98, Group 6 Result Reg. 6, Debug */
#define EVADC_G6_RESD6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021F98u)
/** Alias (User Manual Name) for EVADC_G6_RESD6.
* To use register names with standard convension, please use EVADC_G6_RESD6.
*/
#define EVADC_G6RESD6 (EVADC_G6_RESD6)

/** \brief 1F9C, Group 6 Result Reg. 7, Debug */
#define EVADC_G6_RESD7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021F9Cu)
/** Alias (User Manual Name) for EVADC_G6_RESD7.
* To use register names with standard convension, please use EVADC_G6_RESD7.
*/
#define EVADC_G6RESD7 (EVADC_G6_RESD7)

/** \brief 1FA0, Group 6 Result Reg. 8, Debug */
#define EVADC_G6_RESD8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021FA0u)
/** Alias (User Manual Name) for EVADC_G6_RESD8.
* To use register names with standard convension, please use EVADC_G6_RESD8.
*/
#define EVADC_G6RESD8 (EVADC_G6_RESD8)

/** \brief 1FA4, Group 6 Result Reg. 9, Debug */
#define EVADC_G6_RESD9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021FA4u)
/** Alias (User Manual Name) for EVADC_G6_RESD9.
* To use register names with standard convension, please use EVADC_G6_RESD9.
*/
#define EVADC_G6RESD9 (EVADC_G6_RESD9)

/** \brief 1FA8, Group 6 Result Reg. 10, Debug */
#define EVADC_G6_RESD10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021FA8u)
/** Alias (User Manual Name) for EVADC_G6_RESD10.
* To use register names with standard convension, please use EVADC_G6_RESD10.
*/
#define EVADC_G6RESD10 (EVADC_G6_RESD10)

/** \brief 1FAC, Group 6 Result Reg. 11, Debug */
#define EVADC_G6_RESD11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021FACu)
/** Alias (User Manual Name) for EVADC_G6_RESD11.
* To use register names with standard convension, please use EVADC_G6_RESD11.
*/
#define EVADC_G6RESD11 (EVADC_G6_RESD11)

/** \brief 1FB0, Group 6 Result Reg. 12, Debug */
#define EVADC_G6_RESD12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021FB0u)
/** Alias (User Manual Name) for EVADC_G6_RESD12.
* To use register names with standard convension, please use EVADC_G6_RESD12.
*/
#define EVADC_G6RESD12 (EVADC_G6_RESD12)

/** \brief 1FB4, Group 6 Result Reg. 13, Debug */
#define EVADC_G6_RESD13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021FB4u)
/** Alias (User Manual Name) for EVADC_G6_RESD13.
* To use register names with standard convension, please use EVADC_G6_RESD13.
*/
#define EVADC_G6RESD13 (EVADC_G6_RESD13)

/** \brief 1FB8, Group 6 Result Reg. 14, Debug */
#define EVADC_G6_RESD14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021FB8u)
/** Alias (User Manual Name) for EVADC_G6_RESD14.
* To use register names with standard convension, please use EVADC_G6_RESD14.
*/
#define EVADC_G6RESD14 (EVADC_G6_RESD14)

/** \brief 1FBC, Group 6 Result Reg. 15, Debug */
#define EVADC_G6_RESD15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021FBCu)
/** Alias (User Manual Name) for EVADC_G6_RESD15.
* To use register names with standard convension, please use EVADC_G6_RESD15.
*/
#define EVADC_G6RESD15 (EVADC_G6_RESD15)

/** \brief 2010, Trigger Control Register, Group 7 */
#define EVADC_G7_TRCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_TRCTR*)0xF0022010u)
/** Alias (User Manual Name) for EVADC_G7_TRCTR.
* To use register names with standard convension, please use EVADC_G7_TRCTR.
*/
#define EVADC_G7TRCTR (EVADC_G7_TRCTR)

/** \brief 2080, Arbitration Config. Register, Group 7 */
#define EVADC_G7_ARBCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0022080u)
/** Alias (User Manual Name) for EVADC_G7_ARBCFG.
* To use register names with standard convension, please use EVADC_G7_ARBCFG.
*/
#define EVADC_G7ARBCFG (EVADC_G7_ARBCFG)

/** \brief 2084, Arbitration Priority Register, Group 7 */
#define EVADC_G7_ARBPR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0022084u)
/** Alias (User Manual Name) for EVADC_G7_ARBPR.
* To use register names with standard convension, please use EVADC_G7_ARBPR.
*/
#define EVADC_G7ARBPR (EVADC_G7_ARBPR)

/** \brief 2088, Analog Fct. Config. Register, Group 7 */
#define EVADC_G7_ANCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0022088u)
/** Alias (User Manual Name) for EVADC_G7_ANCFG.
* To use register names with standard convension, please use EVADC_G7_ANCFG.
*/
#define EVADC_G7ANCFG (EVADC_G7_ANCFG)

