HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEvadc_reg.h
/** \brief 21F8, Valid Flag Register, Group 7 */
#define EVADC_G7_VFR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF00221F8u)
/** Alias (User Manual Name) for EVADC_G7_VFR.
* To use register names with standard convension, please use EVADC_G7_VFR.
*/
#define EVADC_G7VFR (EVADC_G7_VFR)

/** \brief 2200, Group 7, Channel 0 Control Register */
#define EVADC_G7_CHCTR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022200u)
/** Alias (User Manual Name) for EVADC_G7_CHCTR0.
* To use register names with standard convension, please use EVADC_G7_CHCTR0.
*/
#define EVADC_G7CHCTR0 (EVADC_G7_CHCTR0)

/** \brief 2204, Group 7, Channel 1 Control Register */
#define EVADC_G7_CHCTR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022204u)
/** Alias (User Manual Name) for EVADC_G7_CHCTR1.
* To use register names with standard convension, please use EVADC_G7_CHCTR1.
*/
#define EVADC_G7CHCTR1 (EVADC_G7_CHCTR1)

/** \brief 2208, Group 7, Channel 2 Control Register */
#define EVADC_G7_CHCTR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022208u)
/** Alias (User Manual Name) for EVADC_G7_CHCTR2.
* To use register names with standard convension, please use EVADC_G7_CHCTR2.
*/
#define EVADC_G7CHCTR2 (EVADC_G7_CHCTR2)

/** \brief 220C, Group 7, Channel 3 Control Register */
#define EVADC_G7_CHCTR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF002220Cu)
/** Alias (User Manual Name) for EVADC_G7_CHCTR3.
* To use register names with standard convension, please use EVADC_G7_CHCTR3.
*/
#define EVADC_G7CHCTR3 (EVADC_G7_CHCTR3)

/** \brief 2210, Group 7, Channel 4 Control Register */
#define EVADC_G7_CHCTR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022210u)
/** Alias (User Manual Name) for EVADC_G7_CHCTR4.
* To use register names with standard convension, please use EVADC_G7_CHCTR4.
*/
#define EVADC_G7CHCTR4 (EVADC_G7_CHCTR4)

/** \brief 2214, Group 7, Channel 5 Control Register */
#define EVADC_G7_CHCTR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022214u)
/** Alias (User Manual Name) for EVADC_G7_CHCTR5.
* To use register names with standard convension, please use EVADC_G7_CHCTR5.
*/
#define EVADC_G7CHCTR5 (EVADC_G7_CHCTR5)

/** \brief 2218, Group 7, Channel 6 Control Register */
#define EVADC_G7_CHCTR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022218u)
/** Alias (User Manual Name) for EVADC_G7_CHCTR6.
* To use register names with standard convension, please use EVADC_G7_CHCTR6.
*/
#define EVADC_G7CHCTR6 (EVADC_G7_CHCTR6)

/** \brief 221C, Group 7, Channel 7 Control Register */
#define EVADC_G7_CHCTR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF002221Cu)
/** Alias (User Manual Name) for EVADC_G7_CHCTR7.
* To use register names with standard convension, please use EVADC_G7_CHCTR7.
*/
#define EVADC_G7CHCTR7 (EVADC_G7_CHCTR7)

/** \brief 2280, Group 7 Result Control Register 0 */
#define EVADC_G7_RCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022280u)
/** Alias (User Manual Name) for EVADC_G7_RCR0.
* To use register names with standard convension, please use EVADC_G7_RCR0.
*/
#define EVADC_G7RCR0 (EVADC_G7_RCR0)

/** \brief 2284, Group 7 Result Control Register 1 */
#define EVADC_G7_RCR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022284u)
/** Alias (User Manual Name) for EVADC_G7_RCR1.
* To use register names with standard convension, please use EVADC_G7_RCR1.
*/
#define EVADC_G7RCR1 (EVADC_G7_RCR1)

/** \brief 2288, Group 7 Result Control Register 2 */
#define EVADC_G7_RCR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022288u)
/** Alias (User Manual Name) for EVADC_G7_RCR2.
* To use register names with standard convension, please use EVADC_G7_RCR2.
*/
#define EVADC_G7RCR2 (EVADC_G7_RCR2)

/** \brief 228C, Group 7 Result Control Register 3 */
#define EVADC_G7_RCR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF002228Cu)
/** Alias (User Manual Name) for EVADC_G7_RCR3.
* To use register names with standard convension, please use EVADC_G7_RCR3.
*/
#define EVADC_G7RCR3 (EVADC_G7_RCR3)

/** \brief 2290, Group 7 Result Control Register 4 */
#define EVADC_G7_RCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022290u)
/** Alias (User Manual Name) for EVADC_G7_RCR4.
* To use register names with standard convension, please use EVADC_G7_RCR4.
*/
#define EVADC_G7RCR4 (EVADC_G7_RCR4)

/** \brief 2294, Group 7 Result Control Register 5 */
#define EVADC_G7_RCR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022294u)
/** Alias (User Manual Name) for EVADC_G7_RCR5.
* To use register names with standard convension, please use EVADC_G7_RCR5.
*/
#define EVADC_G7RCR5 (EVADC_G7_RCR5)

/** \brief 2298, Group 7 Result Control Register 6 */
#define EVADC_G7_RCR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0022298u)
/** Alias (User Manual Name) for EVADC_G7_RCR6.
* To use register names with standard convension, please use EVADC_G7_RCR6.
*/
#define EVADC_G7RCR6 (EVADC_G7_RCR6)

/** \brief 229C, Group 7 Result Control Register 7 */
#define EVADC_G7_RCR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF002229Cu)
/** Alias (User Manual Name) for EVADC_G7_RCR7.
* To use register names with standard convension, please use EVADC_G7_RCR7.
*/
#define EVADC_G7RCR7 (EVADC_G7_RCR7)

/** \brief 22A0, Group 7 Result Control Register 8 */
#define EVADC_G7_RCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00222A0u)
/** Alias (User Manual Name) for EVADC_G7_RCR8.
* To use register names with standard convension, please use EVADC_G7_RCR8.
*/
#define EVADC_G7RCR8 (EVADC_G7_RCR8)

/** \brief 22A4, Group 7 Result Control Register 9 */
#define EVADC_G7_RCR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00222A4u)
/** Alias (User Manual Name) for EVADC_G7_RCR9.
* To use register names with standard convension, please use EVADC_G7_RCR9.
*/
#define EVADC_G7RCR9 (EVADC_G7_RCR9)

/** \brief 22A8, Group 7 Result Control Register 10 */
#define EVADC_G7_RCR10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00222A8u)
/** Alias (User Manual Name) for EVADC_G7_RCR10.
* To use register names with standard convension, please use EVADC_G7_RCR10.
*/
#define EVADC_G7RCR10 (EVADC_G7_RCR10)

/** \brief 22AC, Group 7 Result Control Register 11 */
#define EVADC_G7_RCR11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00222ACu)
/** Alias (User Manual Name) for EVADC_G7_RCR11.
* To use register names with standard convension, please use EVADC_G7_RCR11.
*/
#define EVADC_G7RCR11 (EVADC_G7_RCR11)

