HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEvadc_reg.h
/** \brief 2CA4, Input Class Register 1, Group 10 */
#define EVADC_G10_ICLASS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF0022CA4u)
/** Alias (User Manual Name) for EVADC_G10_ICLASS1.
* To use register names with standard convension, please use EVADC_G10_ICLASS1.
*/
#define EVADC_G10ICLASS1 (EVADC_G10_ICLASS1)

/** \brief 2CB0, Alias Register, Group 10 */
#define EVADC_G10_ALIAS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF0022CB0u)
/** Alias (User Manual Name) for EVADC_G10_ALIAS.
* To use register names with standard convension, please use EVADC_G10_ALIAS.
*/
#define EVADC_G10ALIAS (EVADC_G10_ALIAS)

/** \brief 2CB8, Boundary Select Register, Group 10 */
#define EVADC_G10_BOUND /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF0022CB8u)
/** Alias (User Manual Name) for EVADC_G10_BOUND.
* To use register names with standard convension, please use EVADC_G10_BOUND.
*/
#define EVADC_G10BOUND (EVADC_G10_BOUND)

/** \brief 2CC0, Synchronization Control Register, Group 10 */
#define EVADC_G10_SYNCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF0022CC0u)
/** Alias (User Manual Name) for EVADC_G10_SYNCTR.
* To use register names with standard convension, please use EVADC_G10_SYNCTR.
*/
#define EVADC_G10SYNCTR (EVADC_G10_SYNCTR)

/** \brief 2D00, Queue 0 Source Contr. Register, Group 10 */
#define EVADC_G10_Q0_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022D00u)
/** Alias (User Manual Name) for EVADC_G10_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G10_Q0_QCTRL.
*/
#define EVADC_G10QCTRL0 (EVADC_G10_Q0_QCTRL)

/** \brief 2D04, Queue 0 Mode Register, Group 10 */
#define EVADC_G10_Q0_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022D04u)
/** Alias (User Manual Name) for EVADC_G10_Q0_QMR.
* To use register names with standard convension, please use EVADC_G10_Q0_QMR.
*/
#define EVADC_G10QMR0 (EVADC_G10_Q0_QMR)

/** \brief 2D08, Queue 0 Status Register, Group 10 */
#define EVADC_G10_Q0_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022D08u)
/** Alias (User Manual Name) for EVADC_G10_Q0_QSR.
* To use register names with standard convension, please use EVADC_G10_Q0_QSR.
*/
#define EVADC_G10QSR0 (EVADC_G10_Q0_QSR)

/** \brief 2D0C, Queue 0 Register 0, Group 10 */
#define EVADC_G10_Q0_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0022D0Cu)
/** Alias (User Manual Name) for EVADC_G10_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G10_Q0_Q0R.
*/
#define EVADC_G10Q0R0 (EVADC_G10_Q0_Q0R)

/** \brief 2D10, Queue 0 Input Register, Group 10 */
#define EVADC_G10_Q0_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022D10u)
/** Alias (User Manual Name) for EVADC_G10_Q0_QINR.
* To use register names with standard convension, please use EVADC_G10_Q0_QINR.
*/
#define EVADC_G10QINR0 (EVADC_G10_Q0_QINR)

/** \brief 2D14, Queue 0 Backup Register, Group 10 */
#define EVADC_G10_Q0_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0022D14u)
/** Alias (User Manual Name) for EVADC_G10_Q0_QBUR.
* To use register names with standard convension, please use EVADC_G10_Q0_QBUR.
*/
#define EVADC_G10QBUR0 (EVADC_G10_Q0_QBUR)

/** \brief 2D18, Queue 0 Requ. Timer Mode Reg., Group 10 */
#define EVADC_G10_Q0_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022D18u)
/** Alias (User Manual Name) for EVADC_G10_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G10_Q0_REQTM.
*/
#define EVADC_G10REQTM0 (EVADC_G10_Q0_REQTM)

/** \brief 2D1C, Queue 0 Requ. Timer Status Reg., Group 10 */
#define EVADC_G10_Q0_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0022D1Cu)
/** Alias (User Manual Name) for EVADC_G10_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G10_Q0_REQTS.
*/
#define EVADC_G10REQTS0 (EVADC_G10_Q0_REQTS)

/** \brief 2D20, Queue 1 Source Contr. Register, Group 10 */
#define EVADC_G10_Q1_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022D20u)
/** Alias (User Manual Name) for EVADC_G10_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G10_Q1_QCTRL.
*/
#define EVADC_G10QCTRL1 (EVADC_G10_Q1_QCTRL)

/** \brief 2D24, Queue 1 Mode Register, Group 10 */
#define EVADC_G10_Q1_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022D24u)
/** Alias (User Manual Name) for EVADC_G10_Q1_QMR.
* To use register names with standard convension, please use EVADC_G10_Q1_QMR.
*/
#define EVADC_G10QMR1 (EVADC_G10_Q1_QMR)

/** \brief 2D28, Queue 1 Status Register, Group 10 */
#define EVADC_G10_Q1_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022D28u)
/** Alias (User Manual Name) for EVADC_G10_Q1_QSR.
* To use register names with standard convension, please use EVADC_G10_Q1_QSR.
*/
#define EVADC_G10QSR1 (EVADC_G10_Q1_QSR)

/** \brief 2D2C, Queue 1 Register 0, Group 10 */
#define EVADC_G10_Q1_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0022D2Cu)
/** Alias (User Manual Name) for EVADC_G10_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G10_Q1_Q0R.
*/
#define EVADC_G10Q0R1 (EVADC_G10_Q1_Q0R)

/** \brief 2D30, Queue 1 Input Register, Group 10 */
#define EVADC_G10_Q1_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022D30u)
/** Alias (User Manual Name) for EVADC_G10_Q1_QINR.
* To use register names with standard convension, please use EVADC_G10_Q1_QINR.
*/
#define EVADC_G10QINR1 (EVADC_G10_Q1_QINR)

/** \brief 2D34, Queue 1 Backup Register, Group 10 */
#define EVADC_G10_Q1_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0022D34u)
/** Alias (User Manual Name) for EVADC_G10_Q1_QBUR.
* To use register names with standard convension, please use EVADC_G10_Q1_QBUR.
*/
#define EVADC_G10QBUR1 (EVADC_G10_Q1_QBUR)

/** \brief 2D38, Queue 1 Requ. Timer Mode Reg., Group 10 */
#define EVADC_G10_Q1_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022D38u)
/** Alias (User Manual Name) for EVADC_G10_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G10_Q1_REQTM.
*/
#define EVADC_G10REQTM1 (EVADC_G10_Q1_REQTM)

/** \brief 2D3C, Queue 1 Requ. Timer Status Reg., Group 10 */
#define EVADC_G10_Q1_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0022D3Cu)
/** Alias (User Manual Name) for EVADC_G10_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G10_Q1_REQTS.
*/
#define EVADC_G10REQTS1 (EVADC_G10_Q1_REQTS)

/** \brief 2D40, Queue 2 Source Contr. Register, Group 10 */
#define EVADC_G10_Q2_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0022D40u)
/** Alias (User Manual Name) for EVADC_G10_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G10_Q2_QCTRL.
*/
#define EVADC_G10QCTRL2 (EVADC_G10_Q2_QCTRL)

