HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEvadc_reg.h
/** \brief 2D44, Queue 2 Mode Register, Group 10 */
#define EVADC_G10_Q2_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0022D44u)
/** Alias (User Manual Name) for EVADC_G10_Q2_QMR.
* To use register names with standard convension, please use EVADC_G10_Q2_QMR.
*/
#define EVADC_G10QMR2 (EVADC_G10_Q2_QMR)

/** \brief 2D48, Queue 2 Status Register, Group 10 */
#define EVADC_G10_Q2_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0022D48u)
/** Alias (User Manual Name) for EVADC_G10_Q2_QSR.
* To use register names with standard convension, please use EVADC_G10_Q2_QSR.
*/
#define EVADC_G10QSR2 (EVADC_G10_Q2_QSR)

/** \brief 2D4C, Queue 2 Register 0, Group 10 */
#define EVADC_G10_Q2_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0022D4Cu)
/** Alias (User Manual Name) for EVADC_G10_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G10_Q2_Q0R.
*/
#define EVADC_G10Q0R2 (EVADC_G10_Q2_Q0R)

/** \brief 2D50, Queue 2 Input Register, Group 10 */
#define EVADC_G10_Q2_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0022D50u)
/** Alias (User Manual Name) for EVADC_G10_Q2_QINR.
* To use register names with standard convension, please use EVADC_G10_Q2_QINR.
*/
#define EVADC_G10QINR2 (EVADC_G10_Q2_QINR)

/** \brief 2D54, Queue 2 Backup Register, Group 10 */
#define EVADC_G10_Q2_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0022D54u)
/** Alias (User Manual Name) for EVADC_G10_Q2_QBUR.
* To use register names with standard convension, please use EVADC_G10_Q2_QBUR.
*/
#define EVADC_G10QBUR2 (EVADC_G10_Q2_QBUR)

/** \brief 2D58, Queue 2 Requ. Timer Mode Reg., Group 10 */
#define EVADC_G10_Q2_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0022D58u)
/** Alias (User Manual Name) for EVADC_G10_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G10_Q2_REQTM.
*/
#define EVADC_G10REQTM2 (EVADC_G10_Q2_REQTM)

/** \brief 2D5C, Queue 2 Requ. Timer Status Reg., Group 10 */
#define EVADC_G10_Q2_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0022D5Cu)
/** Alias (User Manual Name) for EVADC_G10_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G10_Q2_REQTS.
*/
#define EVADC_G10REQTS2 (EVADC_G10_Q2_REQTS)

/** \brief 2D80, Channel Event Flag Register, Group 10 */
#define EVADC_G10_CEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0022D80u)
/** Alias (User Manual Name) for EVADC_G10_CEFLAG.
* To use register names with standard convension, please use EVADC_G10_CEFLAG.
*/
#define EVADC_G10CEFLAG (EVADC_G10_CEFLAG)

/** \brief 2D84, Result Event Flag Register, Group 10 */
#define EVADC_G10_REFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0022D84u)
/** Alias (User Manual Name) for EVADC_G10_REFLAG.
* To use register names with standard convension, please use EVADC_G10_REFLAG.
*/
#define EVADC_G10REFLAG (EVADC_G10_REFLAG)

/** \brief 2D88, Source Event Flag Register, Group 10 */
#define EVADC_G10_SEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0022D88u)
/** Alias (User Manual Name) for EVADC_G10_SEFLAG.
* To use register names with standard convension, please use EVADC_G10_SEFLAG.
*/
#define EVADC_G10SEFLAG (EVADC_G10_SEFLAG)

/** \brief 2D90, Channel Event Flag Clear Register, Group 10 */
#define EVADC_G10_CEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0022D90u)
/** Alias (User Manual Name) for EVADC_G10_CEFCLR.
* To use register names with standard convension, please use EVADC_G10_CEFCLR.
*/
#define EVADC_G10CEFCLR (EVADC_G10_CEFCLR)

/** \brief 2D94, Result Event Flag Clear Register, Group 10 */
#define EVADC_G10_REFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0022D94u)
/** Alias (User Manual Name) for EVADC_G10_REFCLR.
* To use register names with standard convension, please use EVADC_G10_REFCLR.
*/
#define EVADC_G10REFCLR (EVADC_G10_REFCLR)

/** \brief 2D98, Source Event Flag Clear Reg., Group 10 */
#define EVADC_G10_SEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0022D98u)
/** Alias (User Manual Name) for EVADC_G10_SEFCLR.
* To use register names with standard convension, please use EVADC_G10_SEFCLR.
*/
#define EVADC_G10SEFCLR (EVADC_G10_SEFCLR)

/** \brief 2DA0, Channel Event Node Pointer Reg. 0, Group 10 */
#define EVADC_G10_CEVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF0022DA0u)
/** Alias (User Manual Name) for EVADC_G10_CEVNP0.
* To use register names with standard convension, please use EVADC_G10_CEVNP0.
*/
#define EVADC_G10CEVNP0 (EVADC_G10_CEVNP0)

/** \brief 2DA4, Channel Event Node Pointer Reg. 1, Group 10 */
#define EVADC_G10_CEVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP1*)0xF0022DA4u)
/** Alias (User Manual Name) for EVADC_G10_CEVNP1.
* To use register names with standard convension, please use EVADC_G10_CEVNP1.
*/
#define EVADC_G10CEVNP1 (EVADC_G10_CEVNP1)

/** \brief 2DB0, Result Event Node Pointer Reg. 0, Group 10 */
#define EVADC_G10_REVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF0022DB0u)
/** Alias (User Manual Name) for EVADC_G10_REVNP0.
* To use register names with standard convension, please use EVADC_G10_REVNP0.
*/
#define EVADC_G10REVNP0 (EVADC_G10_REVNP0)

/** \brief 2DB4, Result Event Node Pointer Reg. 1, Group 10 */
#define EVADC_G10_REVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF0022DB4u)
/** Alias (User Manual Name) for EVADC_G10_REVNP1.
* To use register names with standard convension, please use EVADC_G10_REVNP1.
*/
#define EVADC_G10REVNP1 (EVADC_G10_REVNP1)

/** \brief 2DC0, Source Event Node Pointer Reg., Group 10 */
#define EVADC_G10_SEVNP /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF0022DC0u)
/** Alias (User Manual Name) for EVADC_G10_SEVNP.
* To use register names with standard convension, please use EVADC_G10_SEVNP.
*/
#define EVADC_G10SEVNP (EVADC_G10_SEVNP)

/** \brief 2DC8, Service Request Software Activation Trigger, Group 10 */
#define EVADC_G10_SRACT /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF0022DC8u)
/** Alias (User Manual Name) for EVADC_G10_SRACT.
* To use register names with standard convension, please use EVADC_G10_SRACT.
*/
#define EVADC_G10SRACT (EVADC_G10_SRACT)

/** \brief 2DF0, External Multiplexer Control Reg., Group 10 */
#define EVADC_G10_EMUXCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF0022DF0u)
/** Alias (User Manual Name) for EVADC_G10_EMUXCTR.
* To use register names with standard convension, please use EVADC_G10_EMUXCTR.
*/
#define EVADC_G10EMUXCTR (EVADC_G10_EMUXCTR)

/** \brief 2DF4, Ext. Multiplexer Channel Select Reg., Group 10 */
#define EVADC_G10_EMUXCS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF0022DF4u)
/** Alias (User Manual Name) for EVADC_G10_EMUXCS.
* To use register names with standard convension, please use EVADC_G10_EMUXCS.
*/
#define EVADC_G10EMUXCS (EVADC_G10_EMUXCS)

/** \brief 2DF8, Valid Flag Register, Group 10 */
#define EVADC_G10_VFR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF0022DF8u)
/** Alias (User Manual Name) for EVADC_G10_VFR.
* To use register names with standard convension, please use EVADC_G10_VFR.
*/
#define EVADC_G10VFR (EVADC_G10_VFR)

/** \brief 2E00, Group 10, Channel 0 Control Register */
#define EVADC_G10_CHCTR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0022E00u)
/** Alias (User Manual Name) for EVADC_G10_CHCTR0.
* To use register names with standard convension, please use EVADC_G10_CHCTR0.
*/
#define EVADC_G10CHCTR0 (EVADC_G10_CHCTR0)

